#### 04. 데이터 선택(LOC)

In [2]:
# 예제
data = {
  '학번' : ['1번', '2번', '3번', '4번', '5번'],
  '이름' : ['김자바', '이자바', '박자바', '최캐드', '정캐드'],
  '학급' : ['자바반', '자바반', '자바반', '캐드반', '캐드반'],
  '국어점수' : [90, 80, 70, 100, 90],
  '영어점수' : [70, 80, 80, 70, 90],
  '평균' : [80.0, 80.0, 75.0, 85.0, 90.0],
  '취미' : ['독서', '', '', '요가', '축구']
}

In [4]:
import pandas

df = pandas.DataFrame(data)

df

   학번   이름   학급  국어점수  영어점수    평균  취미
0  1번  김자바  자바반    90    70  80.0  독서
1  2번  이자바  자바반    80    80  80.0
2  3번  박자바  자바반    70    80  75.0
3  4번  최캐드  캐드반   100    70  85.0  요가
4  5번  정캐드  캐드반    90    90  90.0  축구

In [ ]:
# loc를 사용한 특정 데이터 조회
# 문법 : df.loc[조회할 행, 조회할 컬럼]
# loc를 사용하여 데이터를 검색할 때는 index가 설정되어 있어야한다.
# loc는 행과 컬럼을 이름으로 검색한다.

In [ ]:
# 학번 컬럼을 DataFrame의 index로 지정
df.set_index('학번', inplace=True)

In [14]:
df

     이름   학급  국어점수  영어점수    평균  취미
학번
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0
3번  박자바  자바반    70    80  75.0
4번  최캐드  캐드반   100    70  85.0  요가
5번  정캐드  캐드반    90    90  90.0  축구

In [ ]:
# 학번이 1번인 학생의 국어점수 => ※데이터 한 개 조회시 print를 써야 나옴※
print(df.loc['1번', '국어점수'])

90

In [23]:
print(df.국어점수['1번'])

90

In [29]:
# 학번이 1번, 2번인 학생의 국어, 영어점수 조회
df.loc[['1번', '2번'], ['국어점수', '영어점수']]

    국어점수  영어점수
학번
1번    90    70
2번    80    80

In [ ]:
# 학번이 1번~3번인 학생의 국어점수, 영어점수, 평균 => ※ slice 연산과 비슷하게 조건을 작성한다
df.loc['1번' : '3번', '국어점수' : '평균']

    국어점수  영어점수    평균
학번
1번    90    70  80.0
2번    80    80  80.0
3번    70    80  75.0

In [34]:
# iloc를 사용한 데이터 조회
# iloc는 데이터를 index번호로 조회
# 문법 : df.iloc[조회할 행 번호, 조회할 컬럼 번호]
df

     이름   학급  국어점수  영어점수    평균  취미
학번
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0
3번  박자바  자바반    70    80  75.0
4번  최캐드  캐드반   100    70  85.0  요가
5번  정캐드  캐드반    90    90  90.0  축구

In [42]:
# 학번이 1번인 학생의 국어점수
print(df.iloc[0, 2])

90

In [43]:
# 학번이 1번,2번인 학생의 국어, 영어 점수 조회
df.iloc[[0,1], [2,3]]

    국어점수  영어점수
학번
1번    90    70
2번    80    80

In [ ]:
# 학번이 1번~3번인 학생의 국어점수, 영어점수, 평균
# iloc에서 슬라이싱 연산의 마지막 index는 포함하지 않는다. ex> 0:4 = 0 =< n < 4
df.iloc[0:3, 2:5]

    국어점수  영어점수    평균
학번
1번    90    70  80.0
2번    80    80  80.0
3번    70    80  75.0